In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_excel(r'C:\Users\abhis\OneDrive\Desktop\batch_21.xlsx')
df

                 Name         Place     Post  Salary  Age  Gender
0  Abhishek Ingulkaar          Pune       DS  345000   25    Male
1         Ashwini Gat  Ichalkaranji    Admin   45000   33  Female
2        Gaurav Desai          Pune   Tester   80000   28    Male
3      Milind Dhawale         Thane       DS  120000   23    Male
4     Prasad Ganthade       Belgaum  Manager  500000   29    Male
5         Sadia Desai         Dubai       SE  340000   31  Female
6      Shilvanti Kale        Sangli       SE   68000   23  Female
7         Reva Jagtap         Karad       DS   50000   28  Female

## Fetch top 5 records

In [3]:
df.head()

                 Name         Place     Post  Salary  Age  Gender
0  Abhishek Ingulkaar          Pune       DS  345000   25    Male
1         Ashwini Gat  Ichalkaranji    Admin   45000   33  Female
2        Gaurav Desai          Pune   Tester   80000   28    Male
3      Milind Dhawale         Thane       DS  120000   23    Male
4     Prasad Ganthade       Belgaum  Manager  500000   29    Male

## Fetch bottom 5 records

In [4]:
df.tail()

              Name    Place     Post  Salary  Age  Gender
3   Milind Dhawale    Thane       DS  120000   23    Male
4  Prasad Ganthade  Belgaum  Manager  500000   29    Male
5      Sadia Desai    Dubai       SE  340000   31  Female
6   Shilvanti Kale   Sangli       SE   68000   23  Female
7      Reva Jagtap    Karad       DS   50000   28  Female

## Fetch 'Name' column from our dataset

In [5]:
df.columns

Index(['Name', 'Place', 'Post', 'Salary', 'Age', 'Gender'], dtype='object')

In [6]:
df['Name'] # It returns series

0    Abhishek Ingulkaar
1           Ashwini Gat
2          Gaurav Desai
3        Milind Dhawale
4       Prasad Ganthade
5           Sadia Desai
6        Shilvanti Kale
7           Reva Jagtap
Name: Name, dtype: object

In [7]:
df[['Name']] # It returns dataframe (2D) as we have supplied two squared brackets

                 Name
0  Abhishek Ingulkaar
1         Ashwini Gat
2        Gaurav Desai
3      Milind Dhawale
4     Prasad Ganthade
5         Sadia Desai
6      Shilvanti Kale
7         Reva Jagtap

## Create two new/different columns for: firstname and lastname

In [8]:
df.Name.str.split(' ',expand=True)

           0          1
0   Abhishek  Ingulkaar
1    Ashwini        Gat
2     Gaurav      Desai
3     Milind    Dhawale
4     Prasad   Ganthade
5      Sadia      Desai
6  Shilvanti       Kale
7       Reva     Jagtap

In [9]:
s = pd.Series(['ABC-123','PQR-456'])
s

0    ABC-123
1    PQR-456
dtype: object

In [10]:
s.str.split('-',expand=True)

     0    1
0  ABC  123
1  PQR  456

In [11]:
s

0    ABC-123
1    PQR-456
dtype: object

In [12]:
s = pd.Series(['ABC-123', 'PQR:456'])
s

0    ABC-123
1    PQR:456
dtype: object

In [13]:
s.str.split('-', expand=True)

         0     1
0      ABC   123
1  PQR:456  None

In [14]:
s.str.replace(':','-').str.split('-', expand=True)

     0    1
0  ABC  123
1  PQR  456

## Select name and salary columns

In [15]:
df[['Name', 'Salary']]

                 Name  Salary
0  Abhishek Ingulkaar  345000
1         Ashwini Gat   45000
2        Gaurav Desai   80000
3      Milind Dhawale  120000
4     Prasad Ganthade  500000
5         Sadia Desai  340000
6      Shilvanti Kale   68000
7         Reva Jagtap   50000

In [16]:
# You can Alter the sequence 
df[['Salary','Name', 'Age']]

   Salary                Name  Age
0  345000  Abhishek Ingulkaar   25
1   45000         Ashwini Gat   33
2   80000        Gaurav Desai   28
3  120000      Milind Dhawale   23
4  500000     Prasad Ganthade   29
5  340000         Sadia Desai   31
6   68000      Shilvanti Kale   23
7   50000         Reva Jagtap   28

In [17]:
# If we have so many columns then to avoid mistakes and to make the work simple 
# check the column list 
df.columns

Index(['Name', 'Place', 'Post', 'Salary', 'Age', 'Gender'], dtype='object')

### df.loc[:, :] #[Rows, Columns]

In [18]:
# Stop in loc is inclusive
df.loc[:,'Name':'Post'] # it will return the columns form name to post as end is inclusive in loc

                 Name         Place     Post
0  Abhishek Ingulkaar          Pune       DS
1         Ashwini Gat  Ichalkaranji    Admin
2        Gaurav Desai          Pune   Tester
3      Milind Dhawale         Thane       DS
4     Prasad Ganthade       Belgaum  Manager
5         Sadia Desai         Dubai       SE
6      Shilvanti Kale        Sangli       SE
7         Reva Jagtap         Karad       DS

In [19]:
# Now access Name and Gender column
df.loc[:, :'Gender':5]

                 Name  Gender
0  Abhishek Ingulkaar    Male
1         Ashwini Gat  Female
2        Gaurav Desai    Male
3      Milind Dhawale    Male
4     Prasad Ganthade    Male
5         Sadia Desai  Female
6      Shilvanti Kale  Female
7         Reva Jagtap  Female

In [20]:
# Now reverse the columns
df.loc[:, ::-1] # -ve indexing used in the slicing concept

   Gender  Age  Salary     Post         Place                Name
0    Male   25  345000       DS          Pune  Abhishek Ingulkaar
1  Female   33   45000    Admin  Ichalkaranji         Ashwini Gat
2    Male   28   80000   Tester          Pune        Gaurav Desai
3    Male   23  120000       DS         Thane      Milind Dhawale
4    Male   29  500000  Manager       Belgaum     Prasad Ganthade
5  Female   31  340000       SE         Dubai         Sadia Desai
6  Female   23   68000       SE        Sangli      Shilvanti Kale
7  Female   28   50000       DS         Karad         Reva Jagtap

In [21]:
# Slicing we use, only when we want to access something sequentially
# But, if i want to access random columns using loc then ?
df.loc[:, ['Place', 'Name', 'Age']]

          Place                Name  Age
0          Pune  Abhishek Ingulkaar   25
1  Ichalkaranji         Ashwini Gat   33
2          Pune        Gaurav Desai   28
3         Thane      Milind Dhawale   23
4       Belgaum     Prasad Ganthade   29
5         Dubai         Sadia Desai   31
6        Sangli      Shilvanti Kale   23
7         Karad         Reva Jagtap   28

In [22]:
# PS: I want Salary of gaurav
Gaurav_data = df[df.Name == 'Gaurav Desai']

In [36]:
Gaurav_data

           Name Place    Post  Salary  Age Gender
2  Gaurav Desai  Pune  Tester   80000   28   Male

In [38]:
Gaurav_data.Salary # to access only the salary of Gaurav Desai particularly

2    80000
Name: Salary, dtype: int64

In [41]:
# if i want Gaurav and Milind's data together
df[(df.Name == 'Gaurav Desai') | (df.Name == 'Milind Dhawale')]

             Name  Place    Post  Salary  Age Gender
2    Gaurav Desai   Pune  Tester   80000   28   Male
3  Milind Dhawale  Thane      DS  120000   23   Male

In [43]:
final = df[(df.Name == 'Gaurav Desai') | (df.Name == 'Milind Dhawale')]
final[['Name', 'Salary']]

             Name  Salary
2    Gaurav Desai   80000
3  Milind Dhawale  120000

## Find out the name and salary of the employees having salary > 80000

In [25]:
df[df.Salary > 80000][['Name','Salary']]

                 Name  Salary
0  Abhishek Ingulkaar  345000
3      Milind Dhawale  120000
4     Prasad Ganthade  500000
5         Sadia Desai  340000

## Fetch persons in pune having salary > 100000

In [32]:
pune_data = df[df.Place == 'Pune']
pune_data

                 Name Place    Post  Salary  Age Gender
0  Abhishek Ingulkaar  Pune      DS  345000   25   Male
2        Gaurav Desai  Pune  Tester   80000   28   Male

In [33]:
pune_data[pune_data.Salary > 100000]

                 Name Place Post  Salary  Age Gender
0  Abhishek Ingulkaar  Pune   DS  345000   25   Male

In [36]:
df[(df.Place=='Pune') & (df.Salary > 100000)] # precise solution

                 Name Place Post  Salary  Age Gender
0  Abhishek Ingulkaar  Pune   DS  345000   25   Male

## We can get the same answer as above using query()

In [38]:
# syntax: df.query(str)
df.query('Place == "Pune" & Salary > 100000')

                 Name Place Post  Salary  Age Gender
0  Abhishek Ingulkaar  Pune   DS  345000   25   Male

## Fetch an employee who is earing highest salary amongst all in our dataset

In [39]:
df.Salary.max()

500000

In [40]:
df[df.Salary == 500000]

              Name    Place     Post  Salary  Age Gender
4  Prasad Ganthade  Belgaum  Manager  500000   29   Male

## Fetch an employee who is from Thane location

In [ ]:
df.